// Author: Mikhail Ivanov (ivanovmihail99@gmail.com)
#include <fstream>
#include <vector>
#include <string>
#include <unordered_map>
#include <unordered_set>
#include <algorithm>

using namespace std;

unordered_map<string, int> short_dictionary =
{
	{ "Никита Андреев", 0 },
	{ "Дмитрий Архипов", 1 },
	{ "Михаил Бабенко", 2 },
	{ "Ольга Бадажкова", 3 },
	{ "Никита Башаев", 4 },
	{ "Дмитрий Безруков", 5 },
	{ "Михаил Блудов", 6 },
	{ "Екатерина Гащенко", 7 },
	{ "Николай Геравкер", 8 },
	{ "Павел Гранин", 9 },
	{ "Егор Добронравов", 10 },
	{ "Никита Добронравов", 11 },
	{ "Сергей Долгих", 12 },
	{ "Мария Досполова", 13 },
	{ "Ариадна Евтушевская", 14 },
	{ "Матвей Жуков", 15 },
	{ "Михаил Иванов", 16 },
	{ "Александра Истомина", 17 },
	{ "Никита Карагодин", 18 },
	{ "Илья Кассихин", 19 },
	{ "Лев Кац", 20 },
	{ "Наталия Кушнерчук", 21 },
	{ "Анна Люптак", 22 },
	{ "Ольга Мартынова", 23 },
	{ "Виктор Мигрин", 24 },
	{ "Георгий Вепрев", 25 },
	{ "Михаил Миронов", 26 },
	{ "Мария Мирошникова", 27 },
	{ "Николай Мисюра", 28 },
	{ "Даниил Нигомедьянов", 29 },
	{ "Михаил Новиков", 30 },
	{ "Сергей Новожилов", 31 },
	{ "Александр Пак", 32 },
	{ "Василий Приезжев", 33 },
	{ "Пётр Приезжев", 34 },
	{ "Никита Пруцких", 35 },
	{ "Софья Решетова", 36 },
	{ "Дарья Сабирова", 37 },
	{ "Александр Снегов", 38 },
	{ "Вячеслав Сундуков", 39 },
	{ "Ян Сюй", 40 },
	{ "Арман Тадевосян", 41 },
	{ "Александр Токмачёв", 42 },
	{ "Артём Тумашев", 43 },
	{ "Кирилл Тыщук", 44 },
	{ "Олег Фафурин", 45 },
	{ "Тимоти Хофте", 46 },
	{ "Константин Челпанов", 47 },
	{ "Семён Шестаков", 48 },
	{ "Дмитрий Ярцев", 49 },
	{ "Екатерина Торопова", 50 },
	{ "Максим Пукин", 51 },
	{ "Николай Ширшнев", 52 },
	{ "Екатерина Мотылёва", 53 },
	{ "Илья Мишуров", 54 },
	{ "Михаил Спасов", 55 },
	{ "Михаил Львов", 56 },
	{ "Василий Умеренков", 57 }
};
vector<string> teams =
{
	"Андреев Никита Валерьевич",
	"Архипов Дмитрий Сергеевич",
	"Бабенко Михаил Алексеевич",
	"Бадажкова Ольга Александровна",
	"Башаев Никита Константинович",
	"Безруков Дмитрий Витальевич",
	"Блудов Михаил Васильевич",
	"Гащенко Екатерина Александровна",
	"Геравкер Николай Евгеньевич",
	"Гранин Павел Витальевич",
	"Добронравов Егор Петрович",
	"Добронравов Никита Петрович",
	"Долгих Сергей Михайлович",
	"Досполова Мария Каиржановна",
	"Евтушевская Ариадна Юрьевна",
	"Жуков Матвей Максимович",
	"Иванов Михаил Павлович",
	"Истомина Александра Андреевна",
	"Карагодин Никита Алексеевич",
	"Кассихин Илья Алексеевич",
	"Кац Лев Евгеньевич",
	"Кушнерчук Наталия Александровна",
	"Люптак Анна Николаевна",
	"Мартынова Ольга Максимовна",
	"Мигрин Виктор Валерьевич",
	"Вепрев Георгий Анатольевич",
	"Миронов Михаил Николаевич",
	"Мирошникова Мария Андреевна",
	"Мисюра Николай Дмитриевич",
	"Нигомедьянов Даниил Дамирович",
	"Новиков Михаил Игоревич",
	"Новожилов Сергей Алексеевич",
	"Пак Александр Евгеньевич",
	"Приезжев Василий Андреевич",
	"Приезжев Пётр Андреевич",
	"Пруцких Никита Андреевич",
	"Решетова Софья Дмитриевна",
	"Сабирова Дарья Зарифовна",
	"Снегов Александр Александрович",
	"Сундуков Вячеслав Алексеевич",
	"Сюй Ян",
	"Тадевосян Арман Арменович",
	"Токмачёв Александр Сергеевич",
	"Тумашев Артём Александрович",
	"Тыщук Кирилл Ильич",
	"Фафурин Олег Геннадьевич",
	"Хофте Тимоти Андреас",
	"Челпанов Константин Вячеславович",
	"Шестаков Семён Алексеевич",
	"Ярцев Дмитрий Александрович",
	"Торопова Екатерина Дмитриевна",
	"Пукин Максим Александрович",
	"Ширшнев Николай Сергеевич",
	"Мотылёва Екатерина Дмитриевна",
	"Мишуров Илья Дмитриевич",
	"Спасов Михаил Игоревич",
	"Львов Михаил Сергеевич",
	"Умеренков Василий Николаевич"
};
vector<string> logins =
{
	"b17_01",
	"b17_02",
	"b17_03",
	"b17_04",
	"b17_05",
	"b17_06",
	"b17_07",
	"b17_08",
	"b17_09",
	"b17_10",
	"b17_11",
	"b17_12",
	"b17_13",
	"b17_14",
	"b17_15",
	"b17_16",
	"b17_17",
	"b17_18",
	"b17_19",
	"b17_20",
	"b17_21",
	"b17_22",
	"b17_23",
	"b17_24",
	"b17_25",
	"b17_26",
	"b17_27",
	"b17_28",
	"b17_29",
	"b17_30",
	"b17_31",
	"b17_32",
	"b17_33",
	"b17_34",
	"b17_35",
	"b17_36",
	"b17_37",
	"b17_38",
	"b17_39",
	"b17_40",
	"b17_41",
	"b17_42",
	"b17_43",
	"b17_44",
	"b17_45",
	"b17_46",
	"b17_47",
	"b17_48",
	"b17_49",
	"b17_50",
	"b17_51",
	"b17_52",
	"b17_53",
	"b17_54",
	"b17_55",
	"b17_56",
	"b17_57",
	"b17_58"
};
vector<string> groups =
{
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б01-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм",
	"17.Б02-мм"
};

const int GREEN_PLUS_OBSESSION = 16;
const int TIME_1 = 40317;
const int TIME_2 = 40318;
const int FROZEN_TIME = 40319;
const int FINISH_TIME = 40320;

const string PROBLEM_ID = "A";
const string PROBLEM_NAME = "\"Дополнительное задание (?, +30)\"";

int main(int argc, char* argv[])
{
	ifstream fin("total_score.txt");
	string s;
	vector<pair<int, int>> achievements;
	while (getline(fin, s))
	{
		int points = 0, power_of_ten = 1;
		while (s.size() && (s.back() != ' '))
		{
			points += power_of_ten * (s.back() - '0');
			power_of_ten *= 10;
			s.pop_back();
		}
		if (s.size())
			s.pop_back();
		auto it = short_dictionary.find(s);
		if (it != short_dictionary.end())
			achievements.emplace_back(it->second, points);
	}
	ofstream fout("180509.log");
//	fout << "--- testsys monitor file m180509_b17.dat ---"; fout << '\n';
//	fout << "Text monitors are not supported in contests with IOI-Mode problems"; fout << '\n';
//	fout << "\x1a\n";
	fout << "@contest \"Практика по программированию: дополнительное задание, среда, 9 мая 2018 года\""; fout << '\n';
	fout << "@startat 09.05.2018 00:00:00"; fout << '\n';
	fout << "@contlen " << FINISH_TIME; fout << '\n';
	fout << "@now 0"; fout << '\n';
	fout << "@state RUNNING"; fout << '\n';
	fout << "@freeze " << FROZEN_TIME; fout << '\n';
	fout << "@problems 1"; fout << '\n';
	fout << "@teams " << achievements.size(); fout << '\n';
	fout << "@submissions " << achievements.size(); fout << '\n';
	fout << "@comment @pragma IgnoreCE"; fout << '\n';
	fout << "@comment @pragma IgnoreSubmTime"; fout << '\n';
	fout << "@comment @pragma HideUnfrozenCount"; fout << '\n';
	fout << "@p " << PROBLEM_ID << "," << PROBLEM_NAME << ",0,0"; fout << '\n';
	for (int i = 0; i < ((int)(achievements.size())); ++i)
		fout << "@t " << logins[achievements[i].first] << ",0,1,\"" << teams[achievements[i].first] << " (" << groups[achievements[i].first] << ")\"\n";
	for (int i = 0; i < ((int)(achievements.size())); ++i)
		fout << "@s " << logins[achievements[i].first] << "," << PROBLEM_ID << ",1," << ((achievements[i].first == GREEN_PLUS_OBSESSION ? TIME_1 : TIME_2)) << "," << achievements[i].second << "\n";
	return 0;
}
